---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.Uninitialized
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.Uninitialized

Revit has not tried to load the link, possibly because it is a nested
 link and its parent failed to load.